<?php

return [
	'singular' => 'پروژه',
	'plural' => 'پروژه ها',

	//Fields
	'fields' => [
		'title' => 'عنوان پروژه',
		'description' => 'توضیحات پروژه',
	],

	//Placeholders
	'placeholders' => [
		'title' => 'عنوان پروژه را وارد کنید',
		'description' => 'توضیحات پروژه را وارد کنید',
	],

	//Errors
	'validations' => [
		'title' => [
			'required' => 'لطفا عنوان پروژه را وارد کنید',
			'max' => 'طول عنوان پروژه نمی تواند بیشتر از  200 کاراکتر باشد',
		],
	],

	//Words

	//Actions
	'actions' => [
		'create' => 'ایجاد پروژه',
		'edit' => 'ویرایش پروژه',
	],

	//Sentences
	'sentences' => [
		'store' => [
			'success' => 'پروژه با موفقیت ذخیره شد',
			'error' => 'خطایی در ذخیره پروژه رخ داده است، لطفا دوباره تلاش کنید',
		],
		'update' => [
			'success' => 'پروژه با موفقیت بروزرسانی شد',
			'error' => 'خطایی در بروزرسانی پروژه رخ داده است، لطفا دوباره تلاش کنید',
		],
		'destroy' => [
			'success' => 'پروژه با موفقیت حذف شد',
			'error' => 'خطایی در حذف پروژه رخ داده است، لطفا دوباره تلاش کنید',
		],
	],

];