<?php

return [
	'singular' => 'ثبت نام',
	'description' => 'مدیریت پروژه های خود را آسان کنید!',

	//Fields
	'fields' => [
		'full_name' => 'نام و نام خانوادگی',
		'email' => 'ایمیل',
		'username' => 'نام کاربری',
		'password' => 'کلمه عبور',
		'password_confirmation' => 'تکرار کلمه عبور',
	],

	//Placeholders
	'placeholders' => [
		'full_name' => 'نام و نام خانوادگی خود را وارد کنید',
		'email' => 'ایمیل  خود را وارد کنید',
		'username' => 'نام کاربری  خود را وارد کنید',
		'password' => '**********',
	],

	//Errors
	'validations' => [
		'full_name' => [
			'required' => 'لطفا نام و نام خانوادگی را وارد کنید',
		],
		'email' => [
			'required' => 'لطفا ایمیل را وارد کنید',
			'invalid' => 'ایمیل وارد شده معتبر نمی باشد',
			'unique' => 'ایمیل وارد شده از قبل وجود دارد',
			'max' => 'طول ایمیل نباید بیشتر از 100 کاراکتر باشد',
		],
		'username' => [
			'required' => 'لطفا نام کاربری را وارد کنید',
			'unique' => 'نام کاربری وارد شده از قبل وجود دارد',
			'max' => 'طول نام کاربری نباید بیشتر از 100 کاراکتر باشد',
		],
		'password' => [
			'required' => 'لطفا کلمه عبور را وارد کنید',
			'match' => 'کلمه عبور با تکرار کلمه عبور باید یکسان باشد',
			'min' => 'طول کلمه عبور جدید حداقل باید 8 کارکاتر باشد',
		],
	],

	//Words
	'words' => [
		'register' => 'ثبت نام',
	],

	//Actions

	//Sentences
	'sentences' => [
		'success' => 'ثبت نام با موفقیت انجام شد',
		'error' => 'خطایی در ثبت نام رخ داده است، لطفا دوباره تلاش کنید',
		'already_have_account' => 'از قبل حساب کاربری دارید؟',
		'login' => 'وارد سیستم شوید',
	],

];