<?php

return [
	'singular' => 'وظیفه',
	'plural' => 'وظایف',

	//Fields
	'fields' => [
		'title' => 'عنوان وظیفه',
		'due_date' => 'تاریخ انجام',
		'deadline' => 'تاریخ پایان',
		'priority' => 'اولویت',
		'status' => 'وضعیت',
		'description' => 'توضیحات وظیفه',
	],

	//Placeholders
	'placeholders' => [
		'title' => 'عنوان وظیفه را وارد کنید',
		'description' => 'توضیحات وظیفه را وارد کنید',
	],

	//Errors
	'validations' => [
		'title' => [
			'required' => 'لطفا عنوان وظیفه را وارد کنید',
			'max' => 'طول عنوان وظیفه نمی تواند بیشتر از  200 کاراکتر باشد',
		],
		'priority' => [
			'required' => 'لطفا اولویت وظیفه را انتخاب کنید',
			'in' => 'اولویت وظیفه معتبر نمی باشد',
		],
		'status' => [
			'required' => 'لطفا وضعیت وظیفه را انتخاب کنید',
			'in' => 'وضعیت وظیفه معتبر نمی باشد',
		],
		'due_date' => [
			'required' => 'لطفا تاریخ انجام را انتخاب کنید',
		],
		'deadline' => [
			'required' => 'لطفا تاریخ پایان را انتخاب کنید',
		],
	],

	//Words

	//Actions
	'actions' => [
		'create' => 'ایجاد وظیفه',
		'edit' => 'ویرایش وظیفه',
	],
	'priorities' => [
		'low' => 'کم',
		'medium' => 'متوسط',
		'high' => 'بالا',
	],
	'statuses' => [
		'complete' => 'انجام شده',
		'incomplete' => 'انجام نشده',
	],

	//Sentences
	'sentences' => [
		'store' => [
			'success' => 'وظیفه با موفقیت ذخیره شد',
			'error' => 'خطایی در ذخیره وظیفه رخ داده است، لطفا دوباره تلاش کنید',
		],
		'update' => [
			'success' => 'وظیفه با موفقیت بروزرسانی شد',
			'error' => 'خطایی در بروزرسانی وظیفه رخ داده است، لطفا دوباره تلاش کنید',
		],
		'destroy' => [
			'success' => 'وظیفه با موفقیت حذف شد',
			'error' => 'خطایی در حذف وظیفه رخ داده است، لطفا دوباره تلاش کنید',
		],
	],

];